pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/TB0_367.0_inst7.xml
    <register id="TB0CCR4" width="16" offset="0x1A" internal="0" description="Timer_B Capture/Compare  Register">
    </register>
    <register id="TB0CCR5" width="16" offset="0x1C" internal="0" description="Timer_B Capture/Compare  Register">
    </register>
    <register id="TB0CCR6" width="16" offset="0x1E" internal="0" description="Timer_B Capture/Compare  Register">
    </register>
    <register id="TB0EX0" width="16" offset="0x20" internal="0" description="Timer_Bx Expansion Register 0">
        <bitfield id="TBIDEX" description="Input divider expansion" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="Divide by 1"/>
            <bitenum id="2" value="0x1" description="Divide by 2"/>
            <bitenum id="3" value="0x2" description="Divide by 3"/>
            <bitenum id="4" value="0x3" description="Divide by 4"/>
            <bitenum id="5" value="0x4" description="Divide by 5"/>
            <bitenum id="6" value="0x5" description="Divide by 6"/>
            <bitenum id="7" value="0x6" description="Divide by 7"/>
            <bitenum id="8" value="0x7" description="Divide by 8"/>
        </bitfield>
    </register>
    <register id="TB0IV" width="16" offset="0x2E" internal="0" description="Timer_Bx Interrupt Vector Register">
        <bitfield id="TBIV" description="Timer_B interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="TBCCR1" value="0x2" description="Interrupt Source: Capture/compare 1; Interrupt Flag: TBxCCR1 CCIFG; Interrupt Priority: Highest"/>
            <bitenum id="TBCCR2" value="0x4" description="Interrupt Source: Capture/compare 2; Interrupt Flag: TBxCCR2 CCIFG"/>
            <bitenum id="TBCCR3" value="0x6" description="Interrupt Source: Capture/compare 3; Interrupt Flag: TBxCCR3 CCIFG"/>
            <bitenum id="TBCCR4" value="0x8" description="Interrupt Source: Capture/compare 4; Interrupt Flag: TBxCCR4 CCIFG"/>
            <bitenum id="TBCCR5" value="0xA" description="Interrupt Source: Capture/compare 5; Interrupt Flag: TBxCCR5 CCIFG"/>
            <bitenum id="TBCCR6" value="0xC" description="Interrupt Source: Capture/compare 6; Interrupt Flag: TBxCCR6 CCIFG"/>
            <bitenum id="TBIFG" value="0xE" description="Interrupt Source: Timer overflow; Interrupt Flag: TBxCTL TBIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
</module>
